// 정규식은 문자열에 포함된 문자 조합을 찾기 위해 사용되는 패턴입니다. 코드를 간략하게 만들 수 있으나, 가독성이 떨어질 수 있습니다.

// RegExp의 exec, test 메소드와 String의 match, replace, search, split 메소드와 함께 사용됩니다.

// 정규식 패턴이 계속 지속될 경우
var re = /ab+c/;
// 정규식이 계속 지속 될 경우 위와 같은 리터럴 방법을 사용하는 것이 좋습니다.

// 정규식 패턴이 변경되는 경우
var re = new RegExp("ab+c");
// 정규식 패턴이 바뀌는 경우, 생성자 함수를 사용하여 동적으로 정규식을 만들 수 있습니다.


// 특수문자를 사용한 패턴
// 하나 이상의 b를 찾거나, 단순 문자열 패턴보다 다양한 문자열을 찾기 위해 사용됩니다.

// 예를 들어, /ab*c/ 패턴은 'a' 뒤에 0개 이상의 'b'와 바로 뒤에 'c'가 있는 문자열을 찾습니다. /ab*c/는 abbbbbbbbbce에서 abbbbbbbbbc와 매칭됩니다.

/ab*c/.exec("this is abbbbbbbbbce");

// 단순 문자열 패턴
// 단순 문자열 패턴은 직접 찾고자 하는 문자들로 구성됩니다.

// 예를 들어, /abc/는 this is abc의 abc에 매칭됩니다.

/abc/.exec("this is abc");
